app/Controllers/Klasemen.php

SELECT *
FROM `klasemen`
WHERE `nama` = 'Persija'
SELECT *
FROM `klasemen`
WHERE `nama` = 'Persib'
---
                $main[$i] = 1;

                // Retrieve current values from the database
                $currentData1 = $db->table('klasemen')->where('nama', $klub1[$i])->get()->getRow();
                $currentData2 = $db->table('klasemen')->where('nama', $klub2[$i])->get()->getRow();

UPDATE `klasemen` SET `main` = 1, `menang` = 1, `seri` = 0, `kalah` = 0, `gm` = 3, `gk` = 1, `point` = 3
WHERE `nama` = 'Persija'
UPDATE `klasemen` SET `main` = 1, `menang` = 0, `seri` = 0, `kalah` = 1, `gm` = 1, `gk` = 3, `point` = 0
WHERE `nama` = 'Persib'
---
                    'skor_klub2' => $skor2[$i],
                    'pertandingan' => $klub1[$i] . " vs " . $klub2[$i]
                ]);
                $db->table('klasemen')->where('nama', $klub1[$i])->update($data1);
                $db->table('klasemen')->where('nama', $klub2[$i])->update($data2);