app/Models/ModelKlasemen.php

SELECT *
FROM `klasemen`
ORDER BY `point` DESC, `gk` ASC, `gm` DESC
---
    function tampil_data()
    {
        return $this->db->table('klasemen')->orderBy('point', 'desc')->orderBy('gk', 'asc')->orderBy('gm', 'desc')->get()->getResultArray();

INSERT INTO `match` (`skor_klub1`, `skor_klub2`, `pertandingan`) VALUES ('3', '1', 'Persija vs Persib')
---
    function inserttim($data)
    {
        return $this->db->table('match')->insert($data);

UPDATE `klasemen` SET `main` = 'main + 1', `menang` = 'menang + 1', `seri` = 'seri + 0', `kalah` = 'kalah + 0', `gm` = 'gm + 2', `gk` = 'gk + 1', `point` = 'point + 3'
WHERE `nama` = 'Persija'
---
    function edit_tim2($data2, $klub2)
    {
        return $this->db->table('klasemen')->update($data2, array('nama' => $klub2));